app/Cells/ArtikelTerbaru.php

SELECT *
FROM `artikel`
ORDER BY `id` DESC
 LIMIT 5
---
    public function render()
    {
        $model = new ArtikelModel();
        $artikel = $model->orderBy('id', 'DESC')->findAll(5);