app/Controllers/Artikel.php

    public function admin_index()
    {
        $title = 'Daftar Artikel (Admin)';

        $model = new ArtikelModel();
        $kategoriModel = new KategoriModel();

        $q = $this->request->getGet('q');
        $kategori_id = $this->request->getGet('kategori_id');

        $model->select('artikel.*, kategori.nama_kategori')
              ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left');

        if (!empty($q)) {
            $model->like('artikel.judul', $q);
        }

        if (!empty($kategori_id)) {
            $model->where('artikel.id_kategori', $kategori_id);
        }

        $data = [
            'title'       => $title,
            'artikel'     => $model->paginate(5, 'artikel'),
            'pager'       => $model->pager,
            'q'           => $q,
            'kategori_id' => $kategori_id,
            'kategori'    => $kategoriModel->findAll()
---
SELECT COUNT(*) AS `numrows`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
 LIMIT 5
SELECT *
FROM `kategori`