app/Controllers/post.php

    public function index()
    {
        $model = new ArtikelModel();

        $data = [
            'artikel' => $model->orderBy('id', 'DESC')->findAll()
        ];
---
SELECT *
FROM `artikel`
ORDER BY `id` DESC

    public function update($id = null)
    {
        $model = new ArtikelModel();

        if (!$model->find($id)) {
            return $this->failNotFound('Data tidak ditemukan.');
        }

        $data = [
            'judul'  => $this->request->getVar('judul'),
            'isi'    => $this->request->getVar('isi'),
            'status' => $this->request->getVar('status')
        ];

        $model->update($id, $data);
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '1'
UPDATE `artikel` SET `judul` = 'Artikel PERTAMA', `isi` = 'Lorem Ipsum adalah contoh teks atau dummy dalam industri percetakan dan penataan huruf atau typesetting. Lorem Ipsum telah menjadi standar contoh teks sejak tahun 1500-an.', `status` = '1'
WHERE `artikel`.`id` IN ('1')