app/Controllers/User.php

    public function apiLogin()
    {
        $model = new UserModel();

        $email = $this->request->getVar('useremail');
        $password = $this->request->getVar('userpassword');

        $user = $model->where('useremail', $email)->first();
---
SELECT *
FROM `user`
WHERE `useremail` = 'admin@gmail.com'
 LIMIT 1